Revit 2027 API
FabricationPart.VendorCode Property
 The vendor code of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string VendorCode { get; }
Public ReadOnly Property VendorCode As String
	Get
public:
property String^ VendorCode {
	String^ get ();
}
member VendorCode : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace